{
    "products": [
      {
        "id": "1",
        "name": "Elegant Dress",
        "category": "Clothing",
        "description": "This elegant dress is perfect for special occasions.",
        "price": 89.99,
        "variants": [
          {
            "color": "Red",
            "size": "Small"
          },
          {
            "color": "Blue",
            "size": "Medium"
          },
          {
            "color": "Green",
            "size": "Large"
          }
        ],
        "imageSrc": "../src/assets/product/Elegant_Dress.jpg"
      },
      {
        "id": "2",
        "name": "Sports Shoes",
        "category": "Footwear",
        "description": "These comfortable sports shoes are suitable for various activities.",
        "price": 59.99,
        "variants": [
          {
            "color": "Black",
            "size": "9"
          },
          {
            "color": "White",
            "size": "10"
          },
          {
            "color": "Gray",
            "size": "11"
          }
        ],
        "imageSrc": "../src/assets/product/Sport_Shoes.jpg"
      },
      {
        "id": "3",
        "name": "Vintage Watch",
        "category": "Accessories",
        "description": "This vintage watch adds a touch of class to any outfit.",
        "price": 129.99,
        "variants": [
          {
            "color": "Silver",
            "size": "One Size"
          },
          {
            "color": "Gold",
            "size": "One Size"
          }
        ],
        "imageSrc": "../src/assets/product/vintage_watch.jpg"
      },
      {
        "id": "4",
        "name": "Stylish Sunglasses",
        "category": "Accessories",
        "description": "These stylish sunglasses provide both protection and fashion.",
        "price": 39.99,
        "variants": [
          {
            "color": "Black",
            "size": "One Size"
          },
          {
            "color": "Brown",
            "size": "One Size"
          },
          {
            "color": "Silver",
            "size": "One Size"
          }
        ],
        "imageSrc": "../src/assets/product/stylish_sunglasses.jpg"
      },
      {
        "id": "5",
        "name": "Leather Handbag",
        "category": "Accessories",
        "description": "This leather handbag is perfect for carrying your essentials in style.",
        "price": 149.99,
        "variants": [
          {
            "color": "Black",
            "size": "One Size"
          },
          {
            "color": "Brown",
            "size": "One Size"
          }
        ],
        "imageSrc": "../src/assets/product/leather_handbag.jpg"
      },
      {
        "id": "6",
        "name": "Classic T-Shirt",
        "category": "Clothing",
        "description": "This classic t-shirt is a wardrobe staple for everyday wear.",
        "price": 19.99,
        "variants": [
          {
            "color": "White",
            "size": "Small"
          },
          {
            "color": "Black",
            "size": "Medium"
          },
          {
            "color": "Gray",
            "size": "Large"
          }
        ],
        "imageSrc": "../src/assets/product/classic_tshirt.jpg"
      },
      {
        "id": "7",
        "name": "Casual Sneakers",
        "category": "Footwear",
        "description": "These casual sneakers offer both comfort and style for your daily activities.",
        "price": 79.99,
        "variants": [
          {
            "color": "White",
            "size": "8"
          },
          {
            "color": "Black",
            "size": "9"
          },
          {
            "color": "Gray",
            "size": "10"
          }
        ],
        "imageSrc": "../src/assets/product/casual_sneakers.jpg"
      },
      {
        "id": "8",
        "name": "Statement Necklace",
        "category": "Accessories",
        "description": "This statement necklace adds a touch of glamour to any outfit.",
        "price": 49.99,
        "variants": [
          {
            "color": "Gold",
            "size": "One Size"
          },
          {
            "color": "Silver",
            "size": "One Size"
          }
        ],
        "imageSrc": "../src/assets/product/statement_necklace.jpg"
      },
      {
        "id": "9",
        "name": "Slim Fit Jeans",
        "category": "Clothing",
        "description": "These slim fit jeans are a versatile addition to your denim collection.",
        "price": 69.99,
        "variants": [
          {
            "color": "Blue",
            "size": "28Wx30L"
          },
          {
            "color": "Black",
            "size": "30Wx32L"
          },
          {
            "color": "Gray",
            "size": "32Wx34L"
          }
        ],
        "imageSrc": "../src/assets/product/slim_fit_jeans.jpg"
      },
      {
        "id": "10",
        "name": "Cozy Sweater",
        "category": "Clothing",
        "description": "This cozy sweater is perfect for chilly weather and comfortable lounging.",
        "price": 59.99,
        "variants": [
          {
            "color": "Red",
            "size": "Small"
          },
          {
            "color": "Gray",
            "size": "Medium"
          },
          {
            "color": "Navy",
            "size": "Large"
          }
        ],
        "imageSrc": "../src/assets/product/cozy_sweater.jpg"
      },
      {
        "id": "11",
        "name": "Bohemian Maxi Dress",
        "category": "Clothing",
        "description": "This bohemian maxi dress is perfect for a relaxed and stylish look.",
        "price": 79.99,
        "variants": [
          {
            "color": "Floral",
            "size": "Small"
          },
          {
            "color": "Striped",
            "size": "Medium"
          },
          {
            "color": "Solid",
            "size": "Large"
          }
        ],
        "imageSrc": "../src/assets/product/bohemian_maxi_dress.jpg"
      },
      {
        "id": "12",
        "name": "Leather Wallet",
        "category": "Accessories",
        "description": "This leather wallet is both functional and stylish for everyday use.",
        "price": 39.99,
        "variants": [
          {
            "color": "Black",
            "size": "One Size"
          },
          {
            "color": "Brown",
            "size": "One Size"
          }
        ],
        "imageSrc": "../src/assets/product/leather_wallet.jpg"
      }
    ],
    "reviews": [
        {
          "prodId": "1",
          "reviews": [
            {
              "name": "Emily Johnson",
              "starReview": 4,
              "review": "The elegant dress exceeded my expectations! The fabric is of high quality, and the fit is perfect. I received many compliments at the special occasion I wore it to."
            },
            {
              "name": "Sophia Mitchell",
              "starReview": 5,
              "review": "I absolutely love the elegant dress! The color is vibrant, and the material feels luxurious. It's my go-to dress for special occasions."
            },
            {
              "name": "Olivia Roberts",
              "starReview": 4,
              "review": "The elegant dress is stunning! It hugs my curves in all the right places and makes me feel confident. The attention to detail is remarkable."
            }
          ]
        },
        {
          "prodId": "2",
          "reviews": [
            {
              "name": "James Thompson",
              "starReview": 5,
              "review": "These sports shoes are incredibly comfortable! I wear them for my daily runs, and they provide excellent support. The cushioning is fantastic."
            },
            {
              "name": "Ethan Smith",
              "starReview": 4,
              "review": "The sports shoes are versatile and durable. I use them for various activities like hiking and playing basketball. They have great traction and grip."
            },
            {
              "name": "Benjamin Johnson",
              "starReview": 5,
              "review": "I'm impressed with the sports shoes' performance. They're lightweight and allow me to move freely. The design is stylish, and I receive compliments on them."
            }
          ]
        },
        {
          "prodId": "3",
          "reviews": [
            {
              "name": "Sophia Miller",
              "starReview": 4,
              "review": "The vintage watch is a timeless piece that adds a touch of elegance to any outfit. It keeps accurate time, and the craftsmanship is remarkable."
            },
            {
              "name": "Emma Davis",
              "starReview": 5,
              "review": "I adore the vintage watch! The silver color goes well with my jewelry, and the design is unique. It's become my favorite accessory."
            },
            {
              "name": "Isabella Thomas",
              "starReview": 4,
              "review": "The vintage watch is a conversation starter. I love the gold version; it looks luxurious and adds a sophisticated touch to my outfits."
            }
          ]
        },
        {
          "prodId": "4",
          "reviews": [
            {
              "name": "Oliver Wilson",
              "starReview": 3,
              "review": "The stylish sunglasses are trendy and provide decent sun protection. However, I found the build quality to be average, and they felt a bit flimsy."
            },
            {
              "name": "Liam Taylor",
              "starReview": 4,
              "review": "I'm happy with the stylish sunglasses. They provide good shade and fit well. The lenses are clear, and they suit my style."
            },
            {
              "name": "Noah Anderson",
              "starReview": 5,
              "review": "I love these stylish sunglasses! They're comfortable to wear and have excellent UV protection. The black color goes well with any outfit."
            }
          ]
        },
        {
          "prodId": "5",
          "reviews": [
            {
              "name": "Ava Brown",
              "starReview": 5,
              "review": "The leather handbag is fantastic! It's spacious enough to fit all my essentials, and the craftsmanship is top-notch. I receive compliments wherever I go."
            },
            {
              "name": "Mia Wilson",
              "starReview": 4,
              "review": "I'm pleased with the leather handbag. The quality is great, and it's versatile for both casual and formal occasions. The brown color matches well with my outfits."
            },
            {
              "name": "Charlotte Thompson",
              "starReview": 5,
              "review": "The leather handbag is a must-have! It's durable, and the design is timeless. I appreciate the attention to detail, such as the sturdy handles."
            }
          ]
        },
        {
          "prodId": "6",
          "reviews": [
            {
              "name": "Amelia Clark",
              "starReview": 5,
              "review": "The classic t-shirt is comfortable and fits perfectly. It's a versatile piece that goes well with jeans or skirts. I love the soft fabric."
            },
            {
              "name": "Harper Davis",
              "starReview": 4,
              "review": "I'm satisfied with the classic t-shirt. It's a wardrobe staple that I can mix and match with various outfits. The black color is my favorite."
            },
            {
              "name": "Evelyn Moore",
              "starReview": 5,
              "review": "The classic t-shirt is a great addition to my closet. The material is high quality, and it's easy to care for. I'll be buying more in different colors."
            }
          ]
        },
        {
          "prodId": "7",
          "reviews": [
            {
              "name": "Michael Martinez",
              "starReview": 4,
              "review": "The casual sneakers are comfortable and stylish. They're suitable for everyday wear and provide good support. The white color looks clean and trendy."
            },
            {
              "name": "William Thompson",
              "starReview": 5,
              "review": "I'm impressed with the casual sneakers. They're lightweight and perfect for my daily walks. The black color is sleek, and the fit is great."
            },
            {
              "name": "James Harris",
              "starReview": 4,
              "review": "The casual sneakers are my go-to shoes for casual outings. They're easy to slip on, and the gray color matches well with most of my outfits."
            }
          ]
        },
        {
          "prodId": "8",
          "reviews": [
            {
              "name": "Olivia Walker",
              "starReview": 5,
              "review": "The statement necklace is absolutely stunning! It adds a touch of glamour to any outfit. The gold color looks exquisite and catches the light beautifully."
            },
            {
              "name": "Emily Turner",
              "starReview": 4,
              "review": "I'm happy with the statement necklace. It's well-made, and the silver color goes well with my other accessories. It's a statement piece without being too overwhelming."
            },
            {
              "name": "Abigail Clark",
              "starReview": 5,
              "review": "The statement necklace is a showstopper! It's the perfect accessory for formal events. The gold color complements my complexion, and the design is unique."
            }
          ]
        },
        {
          "prodId": "9",
          "reviews": [
            {
              "name": "Elijah Mitchell",
              "starReview": 4,
              "review": "The slim fit jeans are stylish and fit well. They're my go-to jeans for casual outings. The blue color is versatile and goes well with different tops."
            },
            {
              "name": "Alexander Turner",
              "starReview": 5,
              "review": "I love the slim fit jeans! The black color is sleek, and the fit is perfect. They're comfortable to wear all day long, and the quality is excellent."
            },
            {
              "name": "Daniel Roberts",
              "starReview": 4,
              "review": "The slim fit jeans are a great addition to my wardrobe. The gray color is unique, and the slim fit gives me a modern look. They're comfortable and well-made."
            }
          ]
        },
        {
          "prodId": "10",
          "reviews": [
            {
              "name": "Mason Harris",
              "starReview": 5,
              "review": "The cozy sweater is my favorite! It's warm and comfortable, perfect for chilly weather. The red color is vibrant, and the fit is cozy."
            },
            {
              "name": "Sebastian Anderson",
              "starReview": 4,
              "review": "I'm pleased with the cozy sweater. It's soft and keeps me warm on cold days. The gray color goes well with my other wardrobe pieces."
            },
            {
              "name": "Henry Davis",
              "starReview": 5,
              "review": "The cozy sweater is a must-have for winter. It's stylish and keeps me cozy without feeling bulky. The navy color is a nice change from my usual neutrals."
            }
          ]
        },
        {
          "prodId": "11",
          "reviews": [
            {
              "name": "Jack Wilson",
              "starReview": 4,
              "review": "The bohemian maxi dress is beautiful! The floral print is vibrant and perfect for a boho look. The small size fits me well, and the length is just right."
            },
            {
              "name": "Owen Taylor",
              "starReview": 5,
              "review": "I'm in love with the bohemian maxi dress! The striped version is my favorite. It's comfortable, and the medium size flatters my figure. Perfect for summer!"
            },
            {
              "name": "Jackson Thompson",
              "starReview": 4,
              "review": "The bohemian maxi dress is my go-to for a laid-back look. The solid color is versatile, and the large size gives me a relaxed fit. It's a wardrobe essential."
            }
          ]
        },
        {
          "prodId": "12",
          "reviews": [
            {
              "name": "Lucas Moore",
              "starReview": 4,
              "review": "The leather wallet is a great accessory. It's well-crafted, and the black color is sleek. It has enough card slots and compartments for my needs."
            },
            {
              "name": "Carter Turner",
              "starReview": 5,
              "review": "I'm satisfied with the leather wallet. The brown color is rich, and the quality is impressive. It's a stylish and practical choice for everyday use."
            },
            {
              "name": "Joseph Davis",
              "starReview": 4,
              "review": "The leather wallet is exactly what I was looking for. It's compact yet spacious enough for my essentials. The black color is classic and matches my other accessories."
            }
          ]
        }
      ]
    
}
  

